{
  "architectures": ["VideoMAEForVideoClassification"],
  "attention_probs_dropout_prob": 0.0,
  "decoder_hidden_size": 192,
  "decoder_intermediate_size": 768,
  "decoder_num_attention_heads": 3,
  "decoder_num_hidden_layers": 4,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "no-play",
    "1": "play",
    "2": "service"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "no-play": 0,
    "play": 1,
    "service": 2
  },
  "layer_norm_eps": 1e-12,
  "model_type": "videomae",
  "norm_pix_loss": true,
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_frames": 16,
  "num_hidden_layers": 12,
  "num_labels": 3,
  "patch_size": 16,
  "qkv_bias": true,
  "torch_dtype": "float32",
  "tubelet_size": 2,
  "use_mean_pooling": true
}
